In [1]:
# Pandas
# - data structure to handle datasets
# - mainly 2 type of data - series and data frame
# - series is for 1D
# - data-frame is for 2D
# - read/write multiple type of data - csv, excel, json, sql

In [2]:
import pandas as pd

In [4]:
names = ["John", "Max", "Sam", "Nick", "Eddy", "Adam", "Steve"]
series = pd.Series(names)

In [5]:
series

0     John
1      Max
2      Sam
3     Nick
4     Eddy
5     Adam
6    Steve
dtype: object

In [6]:
series = pd.Series(names, index=['a','b','c','d','e','f','g'])

In [7]:
series

a     John
b      Max
c      Sam
d     Nick
e     Eddy
f     Adam
g    Steve
dtype: object

In [8]:
type(series)

pandas.core.series.Series

In [9]:
series[0]

'John'

In [10]:
series[0:3]

a    John
b     Max
c     Sam
dtype: object

In [11]:
employees = {
    "names" : names,
    "salary" : [50000,67000,78000,25000,50000,45000,80000],
    "dept" : ["IT","IT","Admin","HR","IT","HR","Sales"]
}

In [14]:
df = pd.DataFrame(employees)

In [15]:
df

   names  salary   dept
0   John   50000     IT
1    Max   67000     IT
2    Sam   78000  Admin
3   Nick   25000     HR
4   Eddy   50000     IT
5   Adam   45000     HR
6  Steve   80000  Sales

In [16]:
df.describe()

             salary
count      7.000000
mean   56428.571429
std    19721.875696
min    25000.000000
25%    47500.000000
50%    50000.000000
75%    72500.000000
max    80000.000000

In [17]:
# get number of rows and cols in data frame
df.shape

(7, 3)

In [19]:
# it prints first 5 rows
df.head()

  names  salary   dept
0  John   50000     IT
1   Max   67000     IT
2   Sam   78000  Admin
3  Nick   25000     HR
4  Eddy   50000     IT

In [20]:
df.head(3)

  names  salary   dept
0  John   50000     IT
1   Max   67000     IT
2   Sam   78000  Admin

In [21]:
# it prints last 5 rows
df.tail()

   names  salary   dept
2    Sam   78000  Admin
3   Nick   25000     HR
4   Eddy   50000     IT
5   Adam   45000     HR
6  Steve   80000  Sales

In [23]:
# indexing is not supported in data frames
# df[0]

In [24]:
df["names"]

0     John
1      Max
2      Sam
3     Nick
4     Eddy
5     Adam
6    Steve
Name: names, dtype: object

In [25]:
df["names"][0]

'John'

In [29]:
df[["names","salary"]].head(4)

  names  salary
0  John   50000
1   Max   67000
2   Sam   78000
3  Nick   25000

In [30]:
df[["names","salary","dept"]].head(4)

  names  salary   dept
0  John   50000     IT
1   Max   67000     IT
2   Sam   78000  Admin
3  Nick   25000     HR

In [31]:
# Indexing in Data Frames
# it will return 0th index row
df.iloc[0]

names      John
salary    50000
dept         IT
Name: 0, dtype: object

In [32]:
df.iloc[3]

names      Nick
salary    25000
dept         HR
Name: 3, dtype: object

In [33]:
# slicing in data frame
df.iloc[0:3]

  names  salary   dept
0  John   50000     IT
1   Max   67000     IT
2   Sam   78000  Admin

In [34]:
df.iloc[0:3,0:2]

  names  salary
0  John   50000
1   Max   67000
2   Sam   78000

In [35]:
# how to get columns from a particular index
df.iloc[0:3,[0,2]]

  names   dept
0  John     IT
1   Max     IT
2   Sam  Admin

In [36]:
df_2 = pd.DataFrame(employees, index=['A','B','C','D','E','F','G'])

In [37]:
df_2.head()

  names  salary   dept
A  John   50000     IT
B   Max   67000     IT
C   Sam   78000  Admin
D  Nick   25000     HR
E  Eddy   50000     IT

In [39]:
df.loc[0]

names      John
salary    50000
dept         IT
Name: 0, dtype: object

In [41]:
df_2.loc['A']

names      John
salary    50000
dept         IT
Name: A, dtype: object

In [42]:
df_2.loc['B']

names       Max
salary    67000
dept         IT
Name: B, dtype: object

In [43]:
# Filter in Data Frame
df['salary'] > 50000

0    False
1     True
2     True
3    False
4    False
5    False
6     True
Name: salary, dtype: bool

In [44]:
df[df['salary'] > 50000]

   names  salary   dept
1    Max   67000     IT
2    Sam   78000  Admin
6  Steve   80000  Sales

In [46]:
df[(df['salary'] > 50000) & (df['dept'] == 'IT')]

  names  salary dept
1   Max   67000   IT

In [48]:
df.sort_values(by='salary').head()

  names  salary dept
3  Nick   25000   HR
5  Adam   45000   HR
0  John   50000   IT
4  Eddy   50000   IT
1   Max   67000   IT

In [49]:
df.sort_values(by='salary', ascending=False).head()

   names  salary   dept
6  Steve   80000  Sales
2    Sam   78000  Admin
1    Max   67000     IT
0   John   50000     IT
4   Eddy   50000     IT

In [55]:
df.sort_values(by='salary', ascending=False).reset_index(drop=True)

   names  salary   dept
0  Steve   80000  Sales
1    Sam   78000  Admin
2    Max   67000     IT
3   John   50000     IT
4   Eddy   50000     IT
5   Adam   45000     HR
6   Nick   25000     HR

In [57]:
# Get total salary of each department - groupby
df.groupby('dept').sum('salary')

       salary
dept
Admin   78000
HR      70000
IT     167000
Sales   80000